# Inception Network (GoogLeNet Batch Normalization Network)
name: "InceptionNetwork"
### Training Set
layer {
  top: "data"
  top: "label"
  name: "data"
  type: "ImageData"
  image_data_param {
    root_folder:"root/yourdatasetPATH"
    source: "list_train.txt"
    batch_size: 8
    shuffle: true
    new_height: 512
    new_width: 512
  }
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: false
    mean_value: 104
    mean_value: 117
    mean_value: 123
  }
}
layer {
  top: "data"
  top: "label"
  name: "data"
  type: "ImageData"
  image_data_param {
    root_folder:"root/yourdatasetPATH"
    source: "list_val.txt"
    batch_size: 8
    shuffle: false
    new_height: 512
    new_width: 512
  }
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    mean_value: 104
    mean_value: 117
    mean_value: 123
  }
}

layer {
  name: "data/layer1"
  type: "Crop"
  bottom: "data"
  top: "data/layer1"
  crop_param {
    axis: 2
    height: 96
    weight: 96
    offset: 0
    offset: 0
  }
}
layer {
  name: "data/layer2"
  type: "Crop"
  bottom: "data"
  top: "data/layer2"
  crop_param {
    axis: 2
    height: 192
    weight: 256
    offset: 96
    offset: 0
  }
}
layer {
  name: "data/layer3"
  type: "Crop"
  bottom: "data"
  top: "data/layer3"
  crop_param {
    axis: 2
    height: 224
    weight: 256
    offset: 288
    offset: 0
  }
}
layer {
  name: "data/full_data"
  type: "Crop"
  bottom: "data"
  top: "data/full_data"
  crop_param {
    axis: 2
    height: 512
    weight: 256
    offset: 0
    offset: 256
  }
}


layer {
 bottom: "data/layer1"
  top: "layer1/conv1/7x7_s2"
  name: "layer1/conv1/7x7_s2"
  type: "Convolution"
  param {
    name: "layer/conv1/7x7_s2"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 3
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/conv1/7x7_s2"
  name: "layer1/conv1/7x7_s2/bn"
  top: "layer1/conv1/7x7_s2/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/conv1/7x7_s2/bn"
  top: "layer1/conv1/7x7_s2/bn/sc"
  name: "layer1/conv1/7x7_s2/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/conv1/7x7_s2/bn/sc"
  top: "layer1/conv1/7x7_s2/bn/sc"
  name: "layer1/conv1/7x7_s2/bn/sc/relu"
  type: "ReLU"
}
layer {
  bottom: "layer1/conv1/7x7_s2/bn/sc"
  top: "layer1/pool1/3x3_s2"
  name: "layer1/pool1/3x3_s2"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
 bottom: "layer1/pool1/3x3_s2"
  top: "layer1/conv2/3x3_reduce"
  name: "layer1/conv2/3x3_reduce"
  type: "Convolution"
  param {
    name: "layer/conv2/3x3_reduce"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/conv2/3x3_reduce"
  name: "layer1/conv2/3x3_reduce/bn"
  top: "layer1/conv2/3x3_reduce/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/conv2/3x3_reduce/bn"
  top: "layer1/conv2/3x3_reduce/bn/sc"
  name: "layer1/conv2/3x3_reduce/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/conv2/3x3_reduce/bn/sc"
  top: "layer1/conv2/3x3_reduce/bn/sc"
  name: "layer1/conv2/3x3_reduce/bn/sc/relu"
  type: "ReLU"
}
layer {
 bottom: "layer1/conv2/3x3_reduce/bn/sc"
  top: "layer1/conv2/3x3"
  name: "layer1/conv2/3x3"
  type: "Convolution"
  param {
    name: "layer/conv2/3x3"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/conv2/3x3"
  name: "layer1/conv2/3x3/bn"
  top: "layer1/conv2/3x3/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/conv2/3x3/bn"
  top: "layer1/conv2/3x3/bn/sc"
  name: "layer1/conv2/3x3/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/conv2/3x3/bn/sc"
  top: "layer1/conv2/3x3/bn/sc"
  name: "layer1/conv2/3x3/bn/sc/relu"
  type: "ReLU"
}
layer {
  bottom: "layer1/conv2/3x3/bn/sc"
  top: "layer1/pool2/3x3_s2"
  name: "layer1/pool2/3x3_s2"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
 bottom: "layer1/pool2/3x3_s2"
  top: "layer1/inception_3a/1x1"
  name: "layer1/inception_3a/1x1"
  type: "Convolution"
  param {
    name: "layer/inception_3a/1x1"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_3a/1x1"
  name: "layer1/inception_3a/1x1/bn"
  top: "layer1/inception_3a/1x1/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_3a/1x1/bn"
  top: "layer1/inception_3a/1x1/bn/sc"
  name: "layer1/inception_3a/1x1/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_3a/1x1/bn/sc"
  top: "layer1/inception_3a/1x1/bn/sc"
  name: "layer1/inception_3a/1x1/bn/sc/relu"
  type: "ReLU"
}
layer {
 bottom: "layer1/pool2/3x3_s2"
  top: "layer1/inception_3a/3x3_reduce"
  name: "layer1/inception_3a/3x3_reduce"
  type: "Convolution"
  param {
    name: "layer/inception_3a/3x3_reduce"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_3a/3x3_reduce"
  name: "layer1/inception_3a/3x3_reduce/bn"
  top: "layer1/inception_3a/3x3_reduce/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_3a/3x3_reduce/bn"
  top: "layer1/inception_3a/3x3_reduce/bn/sc"
  name: "layer1/inception_3a/3x3_reduce/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_3a/3x3_reduce/bn/sc"
  top: "layer1/inception_3a/3x3_reduce/bn/sc"
  name: "layer1/inception_3a/3x3_reduce/bn/sc/relu"
  type: "ReLU"
}
layer {
 bottom: "layer1/inception_3a/3x3_reduce/bn/sc"
  top: "layer1/inception_3a/3x3"
  name: "layer1/inception_3a/3x3"
  type: "Convolution"
  param {
    name: "layer/inception_3a/3x3"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_3a/3x3"
  name: "layer1/inception_3a/3x3/bn"
  top: "layer1/inception_3a/3x3/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_3a/3x3/bn"
  top: "layer1/inception_3a/3x3/bn/sc"
  name: "layer1/inception_3a/3x3/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_3a/3x3/bn/sc"
  top: "layer1/inception_3a/3x3/bn/sc"
  name: "layer1/inception_3a/3x3/bn/sc/relu"
  type: "ReLU"
}
layer {
 bottom: "layer1/pool2/3x3_s2"
  top: "layer1/inception_3a/double3x3_reduce"
  name: "layer1/inception_3a/double3x3_reduce"
  type: "Convolution"
  param {
    name: "layer/inception_3a/double3x3_reduce"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_3a/double3x3_reduce"
  name: "layer1/inception_3a/double3x3_reduce/bn"
  top: "layer1/inception_3a/double3x3_reduce/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_3a/double3x3_reduce/bn"
  top: "layer1/inception_3a/double3x3_reduce/bn/sc"
  name: "layer1/inception_3a/double3x3_reduce/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_3a/double3x3_reduce/bn/sc"
  top: "layer1/inception_3a/double3x3_reduce/bn/sc"
  name: "layer1/inception_3a/double3x3_reduce/bn/sc/relu"
  type: "ReLU"
}
layer {
 bottom: "layer1/inception_3a/double3x3_reduce/bn/sc"
  top: "layer1/inception_3a/double3x3a"
  name: "layer1/inception_3a/double3x3a"
  type: "Convolution"
  param {
    name: "layer/inception_3a/double3x3a"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_3a/double3x3a"
  name: "layer1/inception_3a/double3x3a/bn"
  top: "layer1/inception_3a/double3x3a/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_3a/double3x3a/bn"
  top: "layer1/inception_3a/double3x3a/bn/sc"
  name: "layer1/inception_3a/double3x3a/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_3a/double3x3a/bn/sc"
  top: "layer1/inception_3a/double3x3a/bn/sc"
  name: "layer1/inception_3a/double3x3a/bn/sc/relu"
  type: "ReLU"
}
layer {
 bottom: "layer1/inception_3a/double3x3a/bn/sc"
  top: "layer1/inception_3a/double3x3b"
  name: "layer1/inception_3a/double3x3b"
  type: "Convolution"
  param {
    name: "layer/inception_3a/double3x3b"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_3a/double3x3b"
  name: "layer1/inception_3a/double3x3b/bn"
  top: "layer1/inception_3a/double3x3b/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_3a/double3x3b/bn"
  top: "layer1/inception_3a/double3x3b/bn/sc"
  name: "layer1/inception_3a/double3x3b/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_3a/double3x3b/bn/sc"
  top: "layer1/inception_3a/double3x3b/bn/sc"
  name: "layer1/inception_3a/double3x3b/bn/sc/relu"
  type: "ReLU"
}
layer {
  bottom: "layer1/pool2/3x3_s2"
  top: "layer1/inception_3a/pool"
  name: "layer1/inception_3a/pool"
  type: "Pooling"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
 bottom: "layer1/inception_3a/pool"
  top: "layer1/inception_3a/pool_proj"
  name: "layer1/inception_3a/pool_proj"
  type: "Convolution"
  param {
    name: "layer/inception_3a/pool_proj"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_3a/pool_proj"
  name: "layer1/inception_3a/pool_proj/bn"
  top: "layer1/inception_3a/pool_proj/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_3a/pool_proj/bn"
  top: "layer1/inception_3a/pool_proj/bn/sc"
  name: "layer1/inception_3a/pool_proj/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_3a/pool_proj/bn/sc"
  top: "layer1/inception_3a/pool_proj/bn/sc"
  name: "layer1/inception_3a/pool_proj/bn/sc/relu"
  type: "ReLU"
}
layer {
  bottom: "layer1/inception_3a/1x1/bn/sc"
  bottom: "layer1/inception_3a/3x3/bn/sc"
  bottom: "layer1/inception_3a/double3x3b/bn/sc"
  bottom: "layer1/inception_3a/pool_proj/bn/sc"
  top: "layer1/inception_3a/output"
  name: "layer1/inception_3a/output"
  type: "Concat"
}
layer {
 bottom: "layer1/inception_3a/output"
  top: "layer1/inception_3b/1x1"
  name: "layer1/inception_3b/1x1"
  type: "Convolution"
  param {
    name: "layer/inception_3b/1x1"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_3b/1x1"
  name: "layer1/inception_3b/1x1/bn"
  top: "layer1/inception_3b/1x1/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_3b/1x1/bn"
  top: "layer1/inception_3b/1x1/bn/sc"
  name: "layer1/inception_3b/1x1/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_3b/1x1/bn/sc"
  top: "layer1/inception_3b/1x1/bn/sc"
  name: "layer1/inception_3b/1x1/bn/sc/relu"
  type: "ReLU"
}
layer {
 bottom: "layer1/inception_3a/output"
  top: "layer1/inception_3b/3x3_reduce"
  name: "layer1/inception_3b/3x3_reduce"
  type: "Convolution"
  param {
    name: "layer/inception_3b/3x3_reduce"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_3b/3x3_reduce"
  name: "layer1/inception_3b/3x3_reduce/bn"
  top: "layer1/inception_3b/3x3_reduce/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_3b/3x3_reduce/bn"
  top: "layer1/inception_3b/3x3_reduce/bn/sc"
  name: "layer1/inception_3b/3x3_reduce/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_3b/3x3_reduce/bn/sc"
  top: "layer1/inception_3b/3x3_reduce/bn/sc"
  name: "layer1/inception_3b/3x3_reduce/bn/sc/relu"
  type: "ReLU"
}
layer {
 bottom: "layer1/inception_3b/3x3_reduce/bn/sc"
  top: "layer1/inception_3b/3x3"
  name: "layer1/inception_3b/3x3"
  type: "Convolution"
  param {
    name: "layer/inception_3b/3x3"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_3b/3x3"
  name: "layer1/inception_3b/3x3/bn"
  top: "layer1/inception_3b/3x3/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_3b/3x3/bn"
  top: "layer1/inception_3b/3x3/bn/sc"
  name: "layer1/inception_3b/3x3/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_3b/3x3/bn/sc"
  top: "layer1/inception_3b/3x3/bn/sc"
  name: "layer1/inception_3b/3x3/bn/sc/relu"
  type: "ReLU"
}
layer {
 bottom: "layer1/inception_3a/output"
  top: "layer1/inception_3b/double3x3_reduce"
  name: "layer1/inception_3b/double3x3_reduce"
  type: "Convolution"
  param {
    name: "layer/inception_3b/double3x3_reduce"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_3b/double3x3_reduce"
  name: "layer1/inception_3b/double3x3_reduce/bn"
  top: "layer1/inception_3b/double3x3_reduce/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_3b/double3x3_reduce/bn"
  top: "layer1/inception_3b/double3x3_reduce/bn/sc"
  name: "layer1/inception_3b/double3x3_reduce/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_3b/double3x3_reduce/bn/sc"
  top: "layer1/inception_3b/double3x3_reduce/bn/sc"
  name: "layer1/inception_3b/double3x3_reduce/bn/sc/relu"
  type: "ReLU"
}
layer {
 bottom: "layer1/inception_3b/double3x3_reduce/bn/sc"
  top: "layer1/inception_3b/double3x3a"
  name: "layer1/inception_3b/double3x3a"
  type: "Convolution"
  param {
    name: "layer/inception_3b/double3x3a"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_3b/double3x3a"
  name: "layer1/inception_3b/double3x3a/bn"
  top: "layer1/inception_3b/double3x3a/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_3b/double3x3a/bn"
  top: "layer1/inception_3b/double3x3a/bn/sc"
  name: "layer1/inception_3b/double3x3a/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_3b/double3x3a/bn/sc"
  top: "layer1/inception_3b/double3x3a/bn/sc"
  name: "layer1/inception_3b/double3x3a/bn/sc/relu"
  type: "ReLU"
}
layer {
 bottom: "layer1/inception_3b/double3x3a/bn/sc"
  top: "layer1/inception_3b/double3x3b"
  name: "layer1/inception_3b/double3x3b"
  type: "Convolution"
  param {
    name: "layer/inception_3b/double3x3b"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_3b/double3x3b"
  name: "layer1/inception_3b/double3x3b/bn"
  top: "layer1/inception_3b/double3x3b/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_3b/double3x3b/bn"
  top: "layer1/inception_3b/double3x3b/bn/sc"
  name: "layer1/inception_3b/double3x3b/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_3b/double3x3b/bn/sc"
  top: "layer1/inception_3b/double3x3b/bn/sc"
  name: "layer1/inception_3b/double3x3b/bn/sc/relu"
  type: "ReLU"
}
layer {
  bottom: "layer1/inception_3a/output"
  top: "layer1/inception_3b/pool"
  name: "layer1/inception_3b/pool"
  type: "Pooling"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
 bottom: "layer1/inception_3b/pool"
  top: "layer1/inception_3b/pool_proj"
  name: "layer1/inception_3b/pool_proj"
  type: "Convolution"
  param {
    name: "layer/inception_3b/pool_proj"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_3b/pool_proj"
  name: "layer1/inception_3b/pool_proj/bn"
  top: "layer1/inception_3b/pool_proj/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_3b/pool_proj/bn"
  top: "layer1/inception_3b/pool_proj/bn/sc"
  name: "layer1/inception_3b/pool_proj/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_3b/pool_proj/bn/sc"
  top: "layer1/inception_3b/pool_proj/bn/sc"
  name: "layer1/inception_3b/pool_proj/bn/sc/relu"
  type: "ReLU"
}
layer {
  bottom: "layer1/inception_3b/1x1/bn/sc"
  bottom: "layer1/inception_3b/3x3/bn/sc"
  bottom: "layer1/inception_3b/double3x3b/bn/sc"
  bottom: "layer1/inception_3b/pool_proj/bn/sc"
  top: "layer1/inception_3b/output"
  name: "layer1/inception_3b/output"
  type: "Concat"
}
layer {
 bottom: "layer1/inception_3b/output"
  top: "layer1/inception_3c/3x3_reduce"
  name: "layer1/inception_3c/3x3_reduce"
  type: "Convolution"
  param {
    name: "layer/inception_3c/3x3_reduce"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_3c/3x3_reduce"
  name: "layer1/inception_3c/3x3_reduce/bn"
  top: "layer1/inception_3c/3x3_reduce/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_3c/3x3_reduce/bn"
  top: "layer1/inception_3c/3x3_reduce/bn/sc"
  name: "layer1/inception_3c/3x3_reduce/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_3c/3x3_reduce/bn/sc"
  top: "layer1/inception_3c/3x3_reduce/bn/sc"
  name: "layer1/inception_3c/3x3_reduce/bn/sc/relu"
  type: "ReLU"
}
layer {
 bottom: "layer1/inception_3c/3x3_reduce/bn/sc"
  top: "layer1/inception_3c/3x3"
  name: "layer1/inception_3c/3x3"
  type: "Convolution"
  param {
    name: "layer/inception_3c/3x3"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 160
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_3c/3x3"
  name: "layer1/inception_3c/3x3/bn"
  top: "layer1/inception_3c/3x3/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_3c/3x3/bn"
  top: "layer1/inception_3c/3x3/bn/sc"
  name: "layer1/inception_3c/3x3/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_3c/3x3/bn/sc"
  top: "layer1/inception_3c/3x3/bn/sc"
  name: "layer1/inception_3c/3x3/bn/sc/relu"
  type: "ReLU"
}
layer {
 bottom: "layer1/inception_3b/output"
  top: "layer1/inception_3c/double3x3_reduce"
  name: "layer1/inception_3c/double3x3_reduce"
  type: "Convolution"
  param {
    name: "layer/inception_3c/double3x3_reduce"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_3c/double3x3_reduce"
  name: "layer1/inception_3c/double3x3_reduce/bn"
  top: "layer1/inception_3c/double3x3_reduce/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_3c/double3x3_reduce/bn"
  top: "layer1/inception_3c/double3x3_reduce/bn/sc"
  name: "layer1/inception_3c/double3x3_reduce/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_3c/double3x3_reduce/bn/sc"
  top: "layer1/inception_3c/double3x3_reduce/bn/sc"
  name: "layer1/inception_3c/double3x3_reduce/bn/sc/relu"
  type: "ReLU"
}
layer {
 bottom: "layer1/inception_3c/double3x3_reduce/bn/sc"
  top: "layer1/inception_3c/double3x3a"
  name: "layer1/inception_3c/double3x3a"
  type: "Convolution"
  param {
    name: "layer/inception_3c/double3x3a"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_3c/double3x3a"
  name: "layer1/inception_3c/double3x3a/bn"
  top: "layer1/inception_3c/double3x3a/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_3c/double3x3a/bn"
  top: "layer1/inception_3c/double3x3a/bn/sc"
  name: "layer1/inception_3c/double3x3a/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_3c/double3x3a/bn/sc"
  top: "layer1/inception_3c/double3x3a/bn/sc"
  name: "layer1/inception_3c/double3x3a/bn/sc/relu"
  type: "ReLU"
}
layer {
 bottom: "layer1/inception_3c/double3x3a/bn/sc"
  top: "layer1/inception_3c/double3x3b"
  name: "layer1/inception_3c/double3x3b"
  type: "Convolution"
  param {
    name: "layer/inception_3c/double3x3b"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_3c/double3x3b"
  name: "layer1/inception_3c/double3x3b/bn"
  top: "layer1/inception_3c/double3x3b/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_3c/double3x3b/bn"
  top: "layer1/inception_3c/double3x3b/bn/sc"
  name: "layer1/inception_3c/double3x3b/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_3c/double3x3b/bn/sc"
  top: "layer1/inception_3c/double3x3b/bn/sc"
  name: "layer1/inception_3c/double3x3b/bn/sc/relu"
  type: "ReLU"
}
layer {
  bottom: "layer1/inception_3b/output"
  top: "layer1/inception_3c/pool"
  name: "layer1/inception_3c/pool"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  bottom: "layer1/inception_3c/3x3/bn/sc"
  bottom: "layer1/inception_3c/double3x3b/bn/sc"
  bottom: "layer1/inception_3c/pool"
  top: "layer1/inception_3c/output"
  name: "layer1/inception_3c/output"
  type: "Concat"
}





layer {
 bottom: "layer1/inception_3c/output"
  top: "layer1/inception_4a/1x1"
  name: "layer1/inception_4a/1x1"
  type: "Convolution"
  param {
    name: "layer/inception_4a/1x1"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 224
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_4a/1x1"
  name: "layer1/inception_4a/1x1/bn"
  top: "layer1/inception_4a/1x1/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_4a/1x1/bn"
  top: "layer1/inception_4a/1x1/bn/sc"
  name: "layer1/inception_4a/1x1/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_4a/1x1/bn/sc"
  top: "layer1/inception_4a/1x1/bn/sc"
  name: "layer1/inception_4a/1x1/bn/sc/relu"
  type: "ReLU"
}
layer {
 bottom: "layer1/inception_3c/output"
  top: "layer1/inception_4a/3x3_reduce"
  name: "layer1/inception_4a/3x3_reduce"
  type: "Convolution"
  param {
    name: "layer/inception_4a/3x3_reduce"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_4a/3x3_reduce"
  name: "layer1/inception_4a/3x3_reduce/bn"
  top: "layer1/inception_4a/3x3_reduce/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_4a/3x3_reduce/bn"
  top: "layer1/inception_4a/3x3_reduce/bn/sc"
  name: "layer1/inception_4a/3x3_reduce/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_4a/3x3_reduce/bn/sc"
  top: "layer1/inception_4a/3x3_reduce/bn/sc"
  name: "layer1/inception_4a/3x3_reduce/bn/sc/relu"
  type: "ReLU"
}
layer {
 bottom: "layer1/inception_4a/3x3_reduce/bn/sc"
  top: "layer1/inception_4a/3x3"
  name: "layer1/inception_4a/3x3"
  type: "Convolution"
  param {
    name: "layer/inception_4a/3x3"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_4a/3x3"
  name: "layer1/inception_4a/3x3/bn"
  top: "layer1/inception_4a/3x3/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_4a/3x3/bn"
  top: "layer1/inception_4a/3x3/bn/sc"
  name: "layer1/inception_4a/3x3/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_4a/3x3/bn/sc"
  top: "layer1/inception_4a/3x3/bn/sc"
  name: "layer1/inception_4a/3x3/bn/sc/relu"
  type: "ReLU"
}
layer {
 bottom: "layer1/inception_3c/output"
  top: "layer1/inception_4a/double3x3_reduce"
  name: "layer1/inception_4a/double3x3_reduce"
  type: "Convolution"
  param {
    name: "layer/inception_4a/double3x3_reduce"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 96
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_4a/double3x3_reduce"
  name: "layer1/inception_4a/double3x3_reduce/bn"
  top: "layer1/inception_4a/double3x3_reduce/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_4a/double3x3_reduce/bn"
  top: "layer1/inception_4a/double3x3_reduce/bn/sc"
  name: "layer1/inception_4a/double3x3_reduce/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_4a/double3x3_reduce/bn/sc"
  top: "layer1/inception_4a/double3x3_reduce/bn/sc"
  name: "layer1/inception_4a/double3x3_reduce/bn/sc/relu"
  type: "ReLU"
}
layer {
 bottom: "layer1/inception_4a/double3x3_reduce/bn/sc"
  top: "layer1/inception_4a/double3x3a"
  name: "layer1/inception_4a/double3x3a"
  type: "Convolution"
  param {
    name: "layer/inception_4a/double3x3a"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_4a/double3x3a"
  name: "layer1/inception_4a/double3x3a/bn"
  top: "layer1/inception_4a/double3x3a/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_4a/double3x3a/bn"
  top: "layer1/inception_4a/double3x3a/bn/sc"
  name: "layer1/inception_4a/double3x3a/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_4a/double3x3a/bn/sc"
  top: "layer1/inception_4a/double3x3a/bn/sc"
  name: "layer1/inception_4a/double3x3a/bn/sc/relu"
  type: "ReLU"
}
layer {
 bottom: "layer1/inception_4a/double3x3a/bn/sc"
  top: "layer1/inception_4a/double3x3b"
  name: "layer1/inception_4a/double3x3b"
  type: "Convolution"
  param {
    name: "layer/inception_4a/double3x3b"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_4a/double3x3b"
  name: "layer1/inception_4a/double3x3b/bn"
  top: "layer1/inception_4a/double3x3b/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_4a/double3x3b/bn"
  top: "layer1/inception_4a/double3x3b/bn/sc"
  name: "layer1/inception_4a/double3x3b/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_4a/double3x3b/bn/sc"
  top: "layer1/inception_4a/double3x3b/bn/sc"
  name: "layer1/inception_4a/double3x3b/bn/sc/relu"
  type: "ReLU"
}
layer {
  bottom: "layer1/inception_3c/output"
  top: "layer1/inception_4a/pool"
  name: "layer1/inception_4a/pool"
  type: "Pooling"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
 bottom: "layer1/inception_4a/pool"
  top: "layer1/inception_4a/pool_proj"
  name: "layer1/inception_4a/pool_proj"
  type: "Convolution"
  param {
    name: "layer/inception_4a/pool_proj"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_4a/pool_proj"
  name: "layer1/inception_4a/pool_proj/bn"
  top: "layer1/inception_4a/pool_proj/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_4a/pool_proj/bn"
  top: "layer1/inception_4a/pool_proj/bn/sc"
  name: "layer1/inception_4a/pool_proj/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_4a/pool_proj/bn/sc"
  top: "layer1/inception_4a/pool_proj/bn/sc"
  name: "layer1/inception_4a/pool_proj/bn/sc/relu"
  type: "ReLU"
}
layer {
  bottom: "layer1/inception_4a/1x1/bn/sc"
  bottom: "layer1/inception_4a/3x3/bn/sc"
  bottom: "layer1/inception_4a/double3x3b/bn/sc"
  bottom: "layer1/inception_4a/pool_proj/bn/sc"
  top: "layer1/inception_4a/output"
  name: "layer1/inception_4a/output"
  type: "Concat"
}
layer {
 bottom: "layer1/inception_4a/output"
  top: "layer1/inception_4b/1x1"
  name: "layer1/inception_4b/1x1"
  type: "Convolution"
  param {
    name: "layer/inception_4b/1x1"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 192
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_4b/1x1"
  name: "layer1/inception_4b/1x1/bn"
  top: "layer1/inception_4b/1x1/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_4b/1x1/bn"
  top: "layer1/inception_4b/1x1/bn/sc"
  name: "layer1/inception_4b/1x1/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_4b/1x1/bn/sc"
  top: "layer1/inception_4b/1x1/bn/sc"
  name: "layer1/inception_4b/1x1/bn/sc/relu"
  type: "ReLU"
}
layer {
 bottom: "layer1/inception_4a/output"
  top: "layer1/inception_4b/3x3_reduce"
  name: "layer1/inception_4b/3x3_reduce"
  type: "Convolution"
  param {
    name: "layer/inception_4b/3x3_reduce"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 96
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_4b/3x3_reduce"
  name: "layer1/inception_4b/3x3_reduce/bn"
  top: "layer1/inception_4b/3x3_reduce/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_4b/3x3_reduce/bn"
  top: "layer1/inception_4b/3x3_reduce/bn/sc"
  name: "layer1/inception_4b/3x3_reduce/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_4b/3x3_reduce/bn/sc"
  top: "layer1/inception_4b/3x3_reduce/bn/sc"
  name: "layer1/inception_4b/3x3_reduce/bn/sc/relu"
  type: "ReLU"
}
layer {
 bottom: "layer1/inception_4b/3x3_reduce/bn/sc"
  top: "layer1/inception_4b/3x3"
  name: "layer1/inception_4b/3x3"
  type: "Convolution"
  param {
    name: "layer/inception_4b/3x3"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_4b/3x3"
  name: "layer1/inception_4b/3x3/bn"
  top: "layer1/inception_4b/3x3/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_4b/3x3/bn"
  top: "layer1/inception_4b/3x3/bn/sc"
  name: "layer1/inception_4b/3x3/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_4b/3x3/bn/sc"
  top: "layer1/inception_4b/3x3/bn/sc"
  name: "layer1/inception_4b/3x3/bn/sc/relu"
  type: "ReLU"
}
layer {
 bottom: "layer1/inception_4a/output"
  top: "layer1/inception_4b/double3x3_reduce"
  name: "layer1/inception_4b/double3x3_reduce"
  type: "Convolution"
  param {
    name: "layer/inception_4b/double3x3_reduce"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 96
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_4b/double3x3_reduce"
  name: "layer1/inception_4b/double3x3_reduce/bn"
  top: "layer1/inception_4b/double3x3_reduce/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_4b/double3x3_reduce/bn"
  top: "layer1/inception_4b/double3x3_reduce/bn/sc"
  name: "layer1/inception_4b/double3x3_reduce/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_4b/double3x3_reduce/bn/sc"
  top: "layer1/inception_4b/double3x3_reduce/bn/sc"
  name: "layer1/inception_4b/double3x3_reduce/bn/sc/relu"
  type: "ReLU"
}
layer {
 bottom: "layer1/inception_4b/double3x3_reduce/bn/sc"
  top: "layer1/inception_4b/double3x3a"
  name: "layer1/inception_4b/double3x3a"
  type: "Convolution"
  param {
    name: "layer/inception_4b/double3x3a"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_4b/double3x3a"
  name: "layer1/inception_4b/double3x3a/bn"
  top: "layer1/inception_4b/double3x3a/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_4b/double3x3a/bn"
  top: "layer1/inception_4b/double3x3a/bn/sc"
  name: "layer1/inception_4b/double3x3a/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_4b/double3x3a/bn/sc"
  top: "layer1/inception_4b/double3x3a/bn/sc"
  name: "layer1/inception_4b/double3x3a/bn/sc/relu"
  type: "ReLU"
}
layer {
 bottom: "layer1/inception_4b/double3x3a/bn/sc"
  top: "layer1/inception_4b/double3x3b"
  name: "layer1/inception_4b/double3x3b"
  type: "Convolution"
  param {
    name: "layer/inception_4b/double3x3b"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_4b/double3x3b"
  name: "layer1/inception_4b/double3x3b/bn"
  top: "layer1/inception_4b/double3x3b/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_4b/double3x3b/bn"
  top: "layer1/inception_4b/double3x3b/bn/sc"
  name: "layer1/inception_4b/double3x3b/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_4b/double3x3b/bn/sc"
  top: "layer1/inception_4b/double3x3b/bn/sc"
  name: "layer1/inception_4b/double3x3b/bn/sc/relu"
  type: "ReLU"
}
layer {
  bottom: "layer1/inception_4a/output"
  top: "layer1/inception_4b/pool"
  name: "layer1/inception_4b/pool"
  type: "Pooling"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
 bottom: "layer1/inception_4b/pool"
  top: "layer1/inception_4b/pool_proj"
  name: "layer1/inception_4b/pool_proj"
  type: "Convolution"
  param {
    name: "layer/inception_4b/pool_proj"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_4b/pool_proj"
  name: "layer1/inception_4b/pool_proj/bn"
  top: "layer1/inception_4b/pool_proj/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_4b/pool_proj/bn"
  top: "layer1/inception_4b/pool_proj/bn/sc"
  name: "layer1/inception_4b/pool_proj/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_4b/pool_proj/bn/sc"
  top: "layer1/inception_4b/pool_proj/bn/sc"
  name: "layer1/inception_4b/pool_proj/bn/sc/relu"
  type: "ReLU"
}
layer {
  bottom: "layer1/inception_4b/1x1/bn/sc"
  bottom: "layer1/inception_4b/3x3/bn/sc"
  bottom: "layer1/inception_4b/double3x3b/bn/sc"
  bottom: "layer1/inception_4b/pool_proj/bn/sc"
  top: "layer1/inception_4b/output"
  name: "layer1/inception_4b/output"
  type: "Concat"
}
layer {
 bottom: "layer1/inception_4b/output"
  top: "layer1/inception_4c/1x1"
  name: "layer1/inception_4c/1x1"
  type: "Convolution"
  param {
    name: "layer/inception_4c/1x1"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 160
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_4c/1x1"
  name: "layer1/inception_4c/1x1/bn"
  top: "layer1/inception_4c/1x1/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_4c/1x1/bn"
  top: "layer1/inception_4c/1x1/bn/sc"
  name: "layer1/inception_4c/1x1/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_4c/1x1/bn/sc"
  top: "layer1/inception_4c/1x1/bn/sc"
  name: "layer1/inception_4c/1x1/bn/sc/relu"
  type: "ReLU"
}
layer {
 bottom: "layer1/inception_4b/output"
  top: "layer1/inception_4c/3x3_reduce"
  name: "layer1/inception_4c/3x3_reduce"
  type: "Convolution"
  param {
    name: "layer/inception_4c/3x3_reduce"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_4c/3x3_reduce"
  name: "layer1/inception_4c/3x3_reduce/bn"
  top: "layer1/inception_4c/3x3_reduce/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_4c/3x3_reduce/bn"
  top: "layer1/inception_4c/3x3_reduce/bn/sc"
  name: "layer1/inception_4c/3x3_reduce/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_4c/3x3_reduce/bn/sc"
  top: "layer1/inception_4c/3x3_reduce/bn/sc"
  name: "layer1/inception_4c/3x3_reduce/bn/sc/relu"
  type: "ReLU"
}
layer {
 bottom: "layer1/inception_4c/3x3_reduce/bn/sc"
  top: "layer1/inception_4c/3x3"
  name: "layer1/inception_4c/3x3"
  type: "Convolution"
  param {
    name: "layer/inception_4c/3x3"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 160
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_4c/3x3"
  name: "layer1/inception_4c/3x3/bn"
  top: "layer1/inception_4c/3x3/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_4c/3x3/bn"
  top: "layer1/inception_4c/3x3/bn/sc"
  name: "layer1/inception_4c/3x3/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_4c/3x3/bn/sc"
  top: "layer1/inception_4c/3x3/bn/sc"
  name: "layer1/inception_4c/3x3/bn/sc/relu"
  type: "ReLU"
}
layer {
 bottom: "layer1/inception_4b/output"
  top: "layer1/inception_4c/double3x3_reduce"
  name: "layer1/inception_4c/double3x3_reduce"
  type: "Convolution"
  param {
    name: "layer/inception_4c/double3x3_reduce"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_4c/double3x3_reduce"
  name: "layer1/inception_4c/double3x3_reduce/bn"
  top: "layer1/inception_4c/double3x3_reduce/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_4c/double3x3_reduce/bn"
  top: "layer1/inception_4c/double3x3_reduce/bn/sc"
  name: "layer1/inception_4c/double3x3_reduce/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_4c/double3x3_reduce/bn/sc"
  top: "layer1/inception_4c/double3x3_reduce/bn/sc"
  name: "layer1/inception_4c/double3x3_reduce/bn/sc/relu"
  type: "ReLU"
}
layer {
 bottom: "layer1/inception_4c/double3x3_reduce/bn/sc"
  top: "layer1/inception_4c/double3x3a"
  name: "layer1/inception_4c/double3x3a"
  type: "Convolution"
  param {
    name: "layer/inception_4c/double3x3a"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 160
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_4c/double3x3a"
  name: "layer1/inception_4c/double3x3a/bn"
  top: "layer1/inception_4c/double3x3a/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_4c/double3x3a/bn"
  top: "layer1/inception_4c/double3x3a/bn/sc"
  name: "layer1/inception_4c/double3x3a/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_4c/double3x3a/bn/sc"
  top: "layer1/inception_4c/double3x3a/bn/sc"
  name: "layer1/inception_4c/double3x3a/bn/sc/relu"
  type: "ReLU"
}
layer {
 bottom: "layer1/inception_4c/double3x3a/bn/sc"
  top: "layer1/inception_4c/double3x3b"
  name: "layer1/inception_4c/double3x3b"
  type: "Convolution"
  param {
    name: "layer/inception_4c/double3x3b"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 160
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_4c/double3x3b"
  name: "layer1/inception_4c/double3x3b/bn"
  top: "layer1/inception_4c/double3x3b/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_4c/double3x3b/bn"
  top: "layer1/inception_4c/double3x3b/bn/sc"
  name: "layer1/inception_4c/double3x3b/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_4c/double3x3b/bn/sc"
  top: "layer1/inception_4c/double3x3b/bn/sc"
  name: "layer1/inception_4c/double3x3b/bn/sc/relu"
  type: "ReLU"
}
layer {
  bottom: "layer1/inception_4b/output"
  top: "layer1/inception_4c/pool"
  name: "layer1/inception_4c/pool"
  type: "Pooling"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
 bottom: "layer1/inception_4c/pool"
  top: "layer1/inception_4c/pool_proj"
  name: "layer1/inception_4c/pool_proj"
  type: "Convolution"
  param {
    name: "layer/inception_4c/pool_proj"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 96
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_4c/pool_proj"
  name: "layer1/inception_4c/pool_proj/bn"
  top: "layer1/inception_4c/pool_proj/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_4c/pool_proj/bn"
  top: "layer1/inception_4c/pool_proj/bn/sc"
  name: "layer1/inception_4c/pool_proj/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_4c/pool_proj/bn/sc"
  top: "layer1/inception_4c/pool_proj/bn/sc"
  name: "layer1/inception_4c/pool_proj/bn/sc/relu"
  type: "ReLU"
}
layer {
  bottom: "layer1/inception_4c/1x1/bn/sc"
  bottom: "layer1/inception_4c/3x3/bn/sc"
  bottom: "layer1/inception_4c/double3x3b/bn/sc"
  bottom: "layer1/inception_4c/pool_proj/bn/sc"
  top: "layer1/inception_4c/output"
  name: "layer1/inception_4c/output"
  type: "Concat"
}
layer {
 bottom: "layer1/inception_4c/output"
  top: "layer1/inception_4d/1x1"
  name: "layer1/inception_4d/1x1"
  type: "Convolution"
  param {
    name: "layer/inception_4d/1x1"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 96
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_4d/1x1"
  name: "layer1/inception_4d/1x1/bn"
  top: "layer1/inception_4d/1x1/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_4d/1x1/bn"
  top: "layer1/inception_4d/1x1/bn/sc"
  name: "layer1/inception_4d/1x1/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_4d/1x1/bn/sc"
  top: "layer1/inception_4d/1x1/bn/sc"
  name: "layer1/inception_4d/1x1/bn/sc/relu"
  type: "ReLU"
}
layer {
 bottom: "layer1/inception_4c/output"
  top: "layer1/inception_4d/3x3_reduce"
  name: "layer1/inception_4d/3x3_reduce"
  type: "Convolution"
  param {
    name: "layer/inception_4d/3x3_reduce"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_4d/3x3_reduce"
  name: "layer1/inception_4d/3x3_reduce/bn"
  top: "layer1/inception_4d/3x3_reduce/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_4d/3x3_reduce/bn"
  top: "layer1/inception_4d/3x3_reduce/bn/sc"
  name: "layer1/inception_4d/3x3_reduce/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_4d/3x3_reduce/bn/sc"
  top: "layer1/inception_4d/3x3_reduce/bn/sc"
  name: "layer1/inception_4d/3x3_reduce/bn/sc/relu"
  type: "ReLU"
}
layer {
 bottom: "layer1/inception_4d/3x3_reduce/bn/sc"
  top: "layer1/inception_4d/3x3"
  name: "layer1/inception_4d/3x3"
  type: "Convolution"
  param {
    name: "layer/inception_4d/3x3"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_4d/3x3"
  name: "layer1/inception_4d/3x3/bn"
  top: "layer1/inception_4d/3x3/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_4d/3x3/bn"
  top: "layer1/inception_4d/3x3/bn/sc"
  name: "layer1/inception_4d/3x3/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_4d/3x3/bn/sc"
  top: "layer1/inception_4d/3x3/bn/sc"
  name: "layer1/inception_4d/3x3/bn/sc/relu"
  type: "ReLU"
}
layer {
 bottom: "layer1/inception_4c/output"
  top: "layer1/inception_4d/double3x3_reduce"
  name: "layer1/inception_4d/double3x3_reduce"
  type: "Convolution"
  param {
    name: "layer/inception_4d/double3x3_reduce"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 160
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_4d/double3x3_reduce"
  name: "layer1/inception_4d/double3x3_reduce/bn"
  top: "layer1/inception_4d/double3x3_reduce/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_4d/double3x3_reduce/bn"
  top: "layer1/inception_4d/double3x3_reduce/bn/sc"
  name: "layer1/inception_4d/double3x3_reduce/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_4d/double3x3_reduce/bn/sc"
  top: "layer1/inception_4d/double3x3_reduce/bn/sc"
  name: "layer1/inception_4d/double3x3_reduce/bn/sc/relu"
  type: "ReLU"
}
layer {
 bottom: "layer1/inception_4d/double3x3_reduce/bn/sc"
  top: "layer1/inception_4d/double3x3a"
  name: "layer1/inception_4d/double3x3a"
  type: "Convolution"
  param {
    name: "layer/inception_4d/double3x3a"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_4d/double3x3a"
  name: "layer1/inception_4d/double3x3a/bn"
  top: "layer1/inception_4d/double3x3a/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_4d/double3x3a/bn"
  top: "layer1/inception_4d/double3x3a/bn/sc"
  name: "layer1/inception_4d/double3x3a/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_4d/double3x3a/bn/sc"
  top: "layer1/inception_4d/double3x3a/bn/sc"
  name: "layer1/inception_4d/double3x3a/bn/sc/relu"
  type: "ReLU"
}
layer {
 bottom: "layer1/inception_4d/double3x3a/bn/sc"
  top: "layer1/inception_4d/double3x3b"
  name: "layer1/inception_4d/double3x3b"
  type: "Convolution"
  param {
    name: "layer/inception_4d/double3x3b"
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  bottom: "layer1/inception_4d/double3x3b"
  name: "layer1/inception_4d/double3x3b/bn"
  top: "layer1/inception_4d/double3x3b/bn"
  type: "BatchNorm"
}
layer {
  bottom: "layer1/inception_4d/double3x3b/bn"
  top: "layer1/inception_4d/double3x3b/bn/sc"
  name: "layer1/inception_4d/double3x3b/bn/sc"
  type: "Scale"
  scale_param {
    bias_term: true
  }
}
layer {
  bottom: "layer1/inception_4d/double3x3b/bn/sc"
  top: "layer1/inception_4d/double3x3b/bn/sc"
  name: "layer1/inception_4d/double3x3b/bn/sc/relu"
  type: "ReLU"
}
layer {
  bottom: "layer1/inception_4c/output"
  top: "layer1/inception_4d/pool"
  name: "layer1/inception_4d/pool"
  type: "Pooling"
  pooling_param {
    pool: AVE
